[
  {
    "title": "Η Επανένωση της Βόρειας με τη Νότια Κορέα",
    "date": "2026-01-28 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/337/i-epanenosi-tis-voreias-me-ti-notia-korea-474-279-6184.jpg",
    "description": "Theatro Dentro and Theatriki Stegi Kyprou present Joël Pommerat’s contemporary work The Reunification of the Two Koreas, directed by Onisiforos Onisiforou, with an exceptional team of cast and crew. A play that explores love and the constant negotiation surrounding it; the choices, sacrifices, and courage required to stand up for one’s relationships and oneself.  The play explores issues that deeply concern modern people: the need for meaningful contact, companionship, and love, as well as the difficulties that accompany every attempt at a real encounter. Through short, dense, and human scenes—at times humorous, at times heartbreaking—it highlights the complexity of relationships and the delicate balance between desire, fear, memory, and responsibility. It illuminates the choices, sacrifices, and courage required to stand honestly before others and ourselves, recording the constant search and struggle for meaningful contact within the difficult reality of our times. A work that opens up space for recognition, reflection, and meaningful dialogue.  Written by: Zoë Pommerat Translated by: Marianna Kalbari Directed by: Onisiforos Onisiforou Set & Costume Design: Giorgos Giannou Music Composition: Andreas Moustoukis  Lighting Design: Christos Gogakis Assistant Director: Andriani Neokleous Poster/Trailer/Photos: Kriton Douris Cast: Stavros Louras, Panagiota Papageorgiou, Vasiliki Kypraiou, Panagiotis Larkou, Katerina Loura, Onisiforos Onisiforou, Christy Charalambous, Andriani Neocleous  Performance duration: 90’ Major Institutional Sponsor: Deputy Ministry of Culture, Department of Contemporary Culture Communication Sponsor: RIK, DIESI101.1 Tickets: €18 / 15 reduced* (only from the Theatre box office) *Pensioners, actors, students, pupils, soldiers, large families, members of the Greek Armed Forces ↘Upon presentation of a valid ID at the box office.",
    "price": "18.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/i-epanenosi-tis-voreias-me-ti-notia-korea-3337"
  },
  {
    "title": "Alfred and Violetta-Gabriadze Theatre",
    "date": "2026-01-30 19:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/333/alfred-and-violetta-gabriadze-theatre-474-279-6182.JPEG",
    "description": "Alfred and Violetta is a tender and ironic love story inspired by Alexandre Dumas’ novel The Lady of the Camellias and Giuseppe Verdi’s opera La Traviata. Rezo Gabriadze relocates the action to contemporary Tbilisi, creating a poetic, cinematic world where marionettes live through real human emotions — with humour, gentleness, pain, and a touch of wistful sadness. It is a story about love as a rare gift, about the clash between dreams and reality, and about the beauty hidden in everyday details. The Rezo Gabriadze Marionette Theatre was founded in 1981 in Tbilisi and is now considered one of the most renowned chamber theatres in the world. Its productions have been presented at Lincoln Center, the Kennedy Center, the Barbican, Théâtre de la Ville, as well as the Avignon and Edinburgh festivals. Critics describe the theatre’s work as “poetry carved in wood” and “marionette art at its highest level.” The theatre is celebrated for its unique visual aesthetic, handcrafted puppets, and the signature artistic language of Rezo Gabriadze, blending humour, philosophy, and Georgian culture. Performed by the puppeteers of the Rezo Gabriadze Marionette Theatre. Directed by: Leo Gabriadze Play and artistic concept: Rezo Gabriadze Duration: 70’ (no interval) In Georgian with Greek and Russian subtitles. Tickets: € 30 - 120",
    "price": "",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/alfred-and-violetta-gabriadze-theatre-3333"
  },
  {
    "title": "Ο Χορός των Εραστών",
    "date": "2026-02-05 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/339/o-khoros-ton-eraston-474-279-6191.jpg",
    "description": "After two sold-out seasons in Greece and rapturous acclaim from the press, Rialto Theatre and Alpha Bank Cyprus present the widely celebrated work by Portuguese playwright and director Tiago Rodrigues, “The Lovers’ Chorus”, which comes to Cyprus for the very first time on the 5th and 6th of February 2026 at 20:30, at Rialto Theatre, Limassol.  The performance was originally staged at the Small Stage of the Onassis Stegi in Athens, where it received an overwhelming response from audiences, and is scheduled to be presented at the Thessaloniki Concert Hall from 22 to 25 January 2026, for a strictly limited run that has already sold out. On stage, acclaimed Greek actors Nikos Karathanos and Marissa Triantafyllidou deliver a rare and deeply affecting performance—one that lingers long after the final moment.  A couple in the middle of the night. “I can’t breathe,” she says. “She can’t breathe,” he repeats. They rush to the car and head for the hospital. From its very first lines, The Lovers’ Chorus draws the audience in and leads them straight into the heart of a relationship. Through fragments of daily life, moments of crisis and intimacy, love and vulnerability, the piece traces the shared journey of two people and their insistence on “forever” — in defiance of time, decay, and uncertainty.  Artistic Director of the Avignon Festival and creator of Catarina and the Beauty of Killing Fascists—presented in 2023 at Onassis Stegi and in 2024 at the Nicosia International Festival—Tiago Rodrigues returns to Cyprus with this profoundly personal work. The Lovers’ Chorus is his first theatrical text and his most autobiographical, written over a long period from 2006 to 2020. Translated into Greek by Maria Papadima, the production balances intensity with tenderness and humour, while a stage covered entirely in soil creates a striking sense of immediacy and raw physical presence. Rodrigues directs in close collaboration with Argyro Chioti, Artistic Associate of the National Theatre of Greece, shaping a performance of remarkable precision and emotional depth. Lighting design is by Rui Monteiro, while the set and costumes are by Magda Bizarro, who is also responsible for international programming at the Avignon Festival.  The production has received outstanding critical acclaim in Greece: Athinorama (Tonia Karoglou): “A small theatrical gem—an invitation to a broader humanism, a political, ecological, and deeply personal way of being that places essential love at its core.” Bookpress (Nikos Xenios): “A unique theatrical experience that will leave a lasting mark on the Athenian theatre scene.” Monopoli (Stella Charami): “A small masterpiece about the mystery of life and love, and an extraordinary interpretative achievement by Nikos Karathanos and Marissa Triantafyllidou.”  Audiences in Cyprus now have the opportunity to experience this exceptional production up close—to encounter a work that explores love and human connection with rare honesty, combining emotional resonance, humour, and intensity into a singular theatrical event. The Lovers’ Chorus is not simply a performance; it is an experience not to be missed. For Cypriot audiences, it offers a rare chance to witness a contemporary theatrical masterpiece by one of today’s most significant creators.  Credits Text & Direction: Tiago Rodrigues Performed by: Nikos Karathanos, Marissa Triantafyllidou Artistic Collaborator: Argyro Chioti Lighting Design: Rui Monteiro Artistic Assistant, Set & Costume Design: Magda Bizarro Translation: Maria Papadima Assistant Set & Costume Designer: Margarita Tzannetou Production Management: Zoi Mouschi – Rena Andreadaki Production for Greece: Onassis Stegi With thanks to: Cláudia Gaiolas, Tónan Quito, Alma Palacios, Océane Caïraty, David Geselson, Grégoire Monsaingeon, Thomas Walgrave The presentation of the performance is supported by the Touring Program of Onassis Stegi.  The presentation of the Performance was supported by Onassis Stegi Touring Program. Language: Greek (no English surtitles) Important note: The stage is covered with soil, which may produce light dust and a subtle scent. The performance is not recommended for audience members with soil-related allergies. Duration:50 minutes Tickets: € 25 / 20 Or call: 77 77 77 45 (Mon–Fri, 10:00–15:00) Rialto Theatre, Limassol Cyprus Organiser: Rialto Theatre Institutional Sponsor: Deputy Ministry of Culture, Department of Contemporary Culture Mega Sponsors: OPAP Cyprus, MEDOCHEMIE, Island Oil Holdings, Alpha Bank Cyprus Media Sponsors: RIK, Kathimerini, Wiz Guide, Kanali 6",
    "price": "25.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/o-khoros-ton-eraston-3339"
  },
  {
    "title": "Keffiyeh/Made in China–Dalia Taha",
    "date": "2026-02-07 20:30:00",
    "venue": "Rialto Theatre - On Stage, ON STAGE Andrea Drousioti 19, Heroes Square, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/340/keffiyehmade-in-chinadalia-taha-474-279-6200.jpg",
    "description": "A work that seeks tenderness amid the absurdity of war.  AntiLogos Theatre presents, for the first time in Greek, a play by Palestinian playwright Dalia Taha, directed by Eleni Anastasiou. Taha composes a mosaic of human stories: an anthology of vignettes that trace every stage of life within a war zone. Harrowing yet at times disarmingly humorous, these everyday moments place ordinary people face to face with decades of oppression, displacement and attempts at erasure. Despite their financial hardship, a mother and a father buy mangoes for their son. A newlywed couple waits in line to cross a checkpoint. A veteran revolutionary admonishes a young soldier about his role. A couple searches for intimacy on a child-free evening. A local factory owner tries to sell a headscarf as a fashion item to a socially conscious young tourist. Two young people talk about their meeting, captured in a viral video of an execution. Parents discuss how to decorate a child’s room in a devastated city.  The play was first presented at the Royal Flemish Theatre in Brussels in 2012 and subsequently toured Palestinian cities in the West Bank. Dalia Taha is known for her deeply moving theatrical works, which delve into the everyday lives of people living in zones of conflict, particularly in Palestine. Her writing penetrates the depths of emotion and intensity, conveying the human experience of siege, war and annihilation. At the same time, it sheds light on both the historical and the quotidian dimensions of the Palestinian question: a longstanding, systemic issue that has taken on new and devastating forms, those of extermination and genocide.  Written by: Dalia Taha Translation: Fotis Fotiou Director: Eleni Anastasiou Movement Director: Ivi Hadjivassiliou Set Design: Mariza Partzili Costume Design: Marina Nikolaidou Lighting Design: Kyriakos Siampanis Video Art: Giorgos Alexandrou Original Music / Soundscape: Savvas Chrysostomou, Frideriki Tombazou Assistant Director: Elia Palatou Cast (in alphabetical order) Dimitris Antoniou, Elia Palatou, Fotis Fotiou, Christina Christofia Major Sponsor: Department of Contemporary Culture – Deputy Ministry of Culture Sponsors: OPAP Cyprus, Laiko Cosmos Trading Supporters: K.S. ICHOTECHNIKI EVENTS Media Sponsors: CyBC, Dialogos Media Group, GNOMI, Black Lemon Duration: 60’ Tickets: € 15/12 (pensioners, students, soldiers, unemployed persons, persons with disabilities)",
    "price": "15.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/keffiyehmade-in-chinadalia-taha-3340"
  },
  {
    "title": "Φεστιβάλ Ταινιών Μικ.Μήκους Δράμας 18+",
    "date": "2026-02-09 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/341/phestival-tainion-mikmikous-djramas-18-474-279-6202.jpg",
    "description": "The awarded Greek short films of Drama International Short Film Festival travel to dozens of destinations every year, including the cities of Limassol, Nicosia, Pafos and Larnaca.  The screenings are co-organised by the Department of Contemporary Culture of the Deputy Ministry of Culture, the Rialto Theatre and DISFF, in collaboration with the Friends of Cinema Society Nicosia, Pafos House of Arts and Letters, and Larnaca and Limassol Cine Clubs. With English subtitles.  Free entrance (in advance booking is required).",
    "price": "0.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/phestival-tainion-mikmikous-djramas-18-3341"
  },
  {
    "title": "My CELLO World",
    "date": "2026-02-11 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/342/my-cello-world-474-279-6201.png",
    "description": "Celebrating forty years of a magical relationship with the cello, the talented Mariliza Papadouri Papangelidi invites audiences to a unique recital of musicality and exceptional technical mastery. A rare opportunity for cello lovers to hear live some of the most iconic and demanding works of the classical repertoire, by composers such as Johannes Brahms, Felix Mendelssohn, Frédéric Chopin, Camille Saint-Saëns, Gabriel Fauré, Claude Debussy, Gaspar Cassadó, Aram Khachaturian, Astor Piazzolla, and Mikis Theodorakis. An evening conceived as a tribute not only to the cello, but also to the piano and to the inseparable, ever-continuing dialogue between the two instruments. Joined at the piano by the internationally acclaimed pianist Anita Tomasevich. Duration: 60’ Tickets: € 20 / 12",
    "price": "20.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/my-cello-world-3342"
  },
  {
    "title": "Okean Elzy:“Watching the Storm”",
    "date": "2026-02-13 19:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/348/okean-elzywatching-the-storm-474-279-6207.png",
    "description": "The Cyprus premiere — a one-time screening only, followed by a meeting with the frontman of Okean Elzy, Sviatoslav Vakarchuk: questions from the audience, an unscripted conversation, and the chance to hear answers firsthand.  On the big screen — the story of a cult band of independent Ukraine, whose songs united millions and became symbols of freedom, love, and resistance. The biographical documentary “Okean Elzy: Watching the Storm” tells the story of a band that grew alongside the country and faced the same historical challenges.  The film combines unique archival footage, previously unknown facts, and sincere memories of people who stood by the band at different stages of its formation. It is an honest account of musical triumphs and overwhelming popularity, as well as the conflicts, breakups, and trials that shaped not only the band but an entire era.  “Okean Elzy: “Watching the Storm” is a journey into music and stories that changed a country. An experience worth sharing together in a movie theater — the emotions after the screening will linger for a long time.  6:30 PM — doors open, 7:00 PM — screening starts Duration: 120' A unique opportunity for Ukrainians in Cyprus to watch “Okean Elzy: Watching the Storm” on the eve of the band’s major concert in Limassol. Organised with the support of the Embassy of Ukraine in the Republic of Cyprus by Community of Ukrainian-Cypriot Friendship in partnership with Cultural Center Obiimy  Tickets: 20 – 40 euro",
    "price": "",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/okean-elzywatching-the-storm-3348"
  },
  {
    "title": "ΜΑΖΙ–Ένα Όνειρο,Μια Ευχή,Μια Φωνή,Μια Ελπίδα",
    "date": "2026-02-14 16:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/343/maziena-oneiromia-eukhimia-phonimia-elpidja-474-279-6197.jpg",
    "description": "In a rapidly changing world, the word TOGETHER becomes action, bringing people closer. A major charity event dedicated to children who are bravely fighting cancer.  Choirs, dancers, actors, students, educators, artists, and athletes from Cyprus and abroad (live and through video messages of hope) unite their voices in an evening of love, hope, and solidarity.  All net proceeds will be donated to the association “One Dream One Wish”, offering tangible support to children and their families.  Because when we stand TOGETHER, no child fights alone.  Organisation – Artistic Direction: Stelios Michaelides Go organised by: Rialto Theatre In collaboration with the Association “One Dream One Wish” Under the auspices of the Ministry of Health Event Participants:  Dance Schools: Yiola Herodotou Ballet Academy, Alexastero Dance and Theatre Studio, Evi’s School of Dance Singing: Nefeli Antoniou (accompanied on piano by Dora Yiannaki), Byron Giorkas and Stella Herodotou, Rafaela Panteli and Christos Georgiou (Cyprus representatives at the Junior Eurovision Song Contest). Orchestra: Astoria Violin Show Quartet, Mandolin Orchestra of the Limassol School Board, conducted by Dora Yiannaki Choirs:  ARIS Limassol Children’s Choir, conducted by Maestro Solon Kladas  Trachoni A’ Primary School Choir, conducted by Angeliki Kouali  IB’ Lanitio Primary School Choir, conducted by Dora Yiannaki  Diamantidou School of Music, Dance and Drama Choir, conducted by Maria Diamantidou  Children’s Choir Cantus, Cantus Choral Music Centre Angelina Nicolaidou, conducted by Elena Michaelidou.  Poetic recital: Technodromio Centre of Letters and Arts in collaboration with Potamos Germasogeia A’ Primary School. Curated by Katerina Voskaridou and Olga Oikonomidou.  Music and Dance Performance:  Evridiki Gregoriou School of Dance and Kato Polemidia B’ Primary School (Agiou Georgiou) curated by Sophia Georgiou  Presenters: Ilias Chaldoupis and Mikaella Theodoulidou Duration: 100’  Tickets: €5",
    "price": "5.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/maziena-oneiromia-eukhimia-phonimia-elpidja-3343"
  },
  {
    "title": "ΕΔΩ ΛΕΜΕ SOS",
    "date": "2026-02-17 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/344/edjo-leme-sos-474-279-6203.PNG",
    "description": "A comedy offering a satirical portrait of contemporary Cypriot reality, rendered with both affection and pain. Eleven exceptional actors find themselves entangled in a succession of comic situations that unfold at a rapid, almost breathless pace, underscoring our virtues and flaws.  Do we still retain any forms of resistance, or are we sacrificing everything on the altar of money? The answer unfolds on stage. In Greek. Written by: Yiorgos Tsiakkas Direction: Marina Vronti Set Design: Elena Katsouri Costume Design: Sophie Andreou Lighting Design: Alex Jotovic Cast: Elena Efstathiou, Marios Dimitriou, Marinos Hadjivassiliou, Mara Konstantinou, Vasilis Charalambous, Marina Vronti, Polyxenie Savva, Angelos Hadjimichael, Stavriana Kadi. Duration: 120’ / +12 Tickets: €18 / 22 / 25",
    "price": "",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/edjo-leme-sos-3344"
  },
  {
    "title": "O γυάλινος κόσμος",
    "date": "2026-02-24 20:30:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/334/o-gualinos-kosmos-474-279-6183.jpg",
    "description": "Theatro DENTRO and Open Arts present Tennessee Williams' emblematic play The Glass Menagerie, directed by Thanasis Georgiou, with an exceptional team of cast and crew. Four lonely souls behind closed doors, four ways of dreaming of a different life.   A mother, Amanda, is clinging to her own reality. Her son, Tom, is a poet who works in a shoe warehouse. Her daughter, Laura, who was left with a physical disability after a childhood illness, finds escape in her collection of small glass animal figurines. All of them are marked by the absence of their father, who abandoned them at a very young age.   The only person who rekindles the family's hopes for a longed-for escape into the light is young Jim. But the prison that each of them has built for themselves proves to be much stronger than they had imagined.   Since 1944, when The Glass Menagerie was first staged, the characters of Tom, Amanda, and Laura have been loved by theatre audiences like few others and have left their mark on world drama. A tender and painful work of remembrance, speaking of unfulfilled dreams, of family commitments and the search for freedom.   The performance is suitable for audiences aged 12 and over.   Written by: Tennessee Williams  Translated by: The Team  Directed by: Thanasis Georgiou  Set Design: Elena Kotasvili, Tasos Govatsos  Costumes: Shona Muir  Music Composition & Sound Design: Giannis Christofidis  Movement: Fotis Nikolaou  Lighting Design: Vasilis Petinaris  Photography: Dimitris Loutsios  Poster Design: Tasos Govatsos   Cast: Sophia Kalli, Andreas Koutsoubas, Maria Konstantinou, Thanasis Georgiou, Stavros Dimopoulos   Duration: 120'  12+   Tickets: €15 GENERAL ADMISSION   Major Institutional Sponsor: Deputy Ministry of Culture, Department of Contemporary Culture",
    "price": "15.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/o-gualinos-kosmos-3334"
  },
  {
    "title": "Η Στέλλα με τα Κόκκινα Γάντια",
    "date": "2026-02-25 20:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/345/i-stella-me-ta-kokkina-gantia-474-279-6204.png",
    "description": "Agia Fylaxeos Lyceum, within the framework of the 37th Pancyprian School Theatre Competition, presents the play “Stella with the Red Gloves” by Iakovos Kambanellis, adapted by Konstantinos Arvanitakis. In a 1950s nightclub called “Paradise”, Stella sings and lives her life freely, refusing to conform to the limits imposed by society on women of that era. Strong-willed and uncompromising, she chooses to define her own life and love. One night she meets Milto, a man deeply in love with her, yet trapped in the prevailing social attitudes of the time. Their relationship develops into a dangerous conflict between love and the need for control. Around them, the people of “Paradise”—Maria, Dimitris, Spyros, and Anneta—become witnesses to a story in which love turns into possession and freedom into a threat. The only one who from the very beginning has a premonition of the tragedy that will unfold is Chrysa, but even she does not act in time; she does nothing, she does not save her. Stella with the Red Gloves is a timeless social drama that sheds light on the position of women in a patriarchal society and raises questions about the meaning of love, “honour,” and personal choice. A play that, despite the era in which it was written, remains tragically relevant. Cast Chrysa: Dimitra Panagiotou, Eleni: Nicole Perikleous, Alekos: Matthaios Mikellidis Maria: Mary Papalouka, Anneta: Nefeli Konstantinou, Stella: Agni Kounouni Spyros: Andreas Petrakis, Dimitris: Konstantinos Christodoulou, Nikos: Simos Kotsōnis, Antonis: Sofronis Pappas, Mother: Chrysovalanto Ioannou Music Piano: Andreas Petrakis, Cello – Violin: Mary TheodosioArtistic Direction – Direction: Rena Tapakoudi Duration: 90' Tickets: € 8",
    "price": "8.00 €",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/i-stella-me-ta-kokkina-gantia-3345"
  },
  {
    "title": "Le Spectre de la Rose",
    "date": "2026-03-11 20:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/347/le-spectre-de-la-rose-474-279-6206.jpg",
    "description": "“Le Spectre de la Rose” is a ballet based on poetry of Théophile Gautier, with exquisite music by Berlioz and Weber. The foundations of this classical ballet were created over 100 years ago. It is regarded as a jewel of world choreography to this day. This white aesthetic ballet intertwines reality with mystical beauty and fairy tales. The dancers are leading ballet soloists from Italy and Cyprus. Choreography: Liliya Sabitova Producer: Petros SteriotisDuration: 75' Tickets:  €10 (under 18 & disabled) €25 (balcony) €30 (hall from 4th row onwards) €35 (hall – first 3 rows)",
    "price": "",
    "category": "Music",
    "url": "https://rialto.interticket.com/program/le-spectre-de-la-rose-3347"
  },
  {
    "title": "Ruslan Bely-Immigracias",
    "date": "2026-03-21 19:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/302/ruslan-bely-immigracias-474-279-6189.jpg",
    "description": "Show in Russian language.  Ruslan Bely is back in Limassol with his new stand-up show “IMMIGRACIAS”, a hilarious and heartfelt take on finding one’s place in the world.  Where we came from, where we are going, and who we are.  As always, bold, uncompromising, about everything and with love!  Stalls (Parterre) – €80 – Rows 1–6 Stalls (Parterre) – €75 – Rows 7–13 Stalls (Parterre) – €70 – Rows 13–18 Balcony + Side Seats – €80 – Rows 1–2 and side sections seats 1–4 & 1–4 Balcony – €75 – Rows 3-4\nРуслан Белый. Стендап-тур \"Immigracias\" \"IMMIGRACIAS\" - новый стендап-концерт Руслана Белого в рамках мирового турне. Как всегда остроумно, легко, доступно для зрителей и, самое главное, смешно.",
    "price": "",
    "category": "Theatre",
    "url": "https://rialto.interticket.com/program/ruslan-bely-immigracias-3302"
  },
  {
    "title": "We Will Return",
    "date": "2026-03-29 20:00:00",
    "venue": "Rialto Theatre, Rialto Andrea Drousioti 19,  Platia Iroon, 3040 Limassol",
    "image": "https://pb2eu.interticket.com/imgs/system-12/program/000/003/319/we-will-return-474-279-6171.jpg",
    "description": "Raj’een (We Will Return) is a moving theatrical production that brings to life the struggles of Palestinians longing to return home. Through powerful storytelling, music, and expressive movement, it captures the resilience, displacement, and unbreakable spirit of a people who continue to dream of freedom. Producer: Ala Khalil Directors: Ala Khalil, Penny Cook, Lyn Thomas-EastCast: Mohanned Hourani, Reem Al Daghma, Jean Louise Anderson Oyono, Penny Cook, Mouatasem Abdoul Jwad, Mohammed Nour Wardeh, Leen Hajjaj, Yusef Al Barjas Duration: 60' Ticket Price: €15",
    "price": "15.00 €",
    "category": "Music",
    "url": "https://rialto.interticket.com/program/we-will-return-3319"
  }
]